	Switch Configuration



	Console into the switch and enable privileged EXEC mode.
	Switch>enable
	Switch#
	
	Enter global configuration mode
	Switch# conf t
	Switch(config)#

	Assign a device name to the switch.
	Switch(config)# hostname (name)
	(name)(config)# 

	Disable DNS lookup.
	Switch(config)# no dns lookup

	Assign a privileged EXEC encrypted password.
	Switch(config)#enable password (password)
	Switch(config)#exit

	Assign a console password and enable login.
	Switch(config)# line console 0
	Switch(config-line)# password (password)
	Switch(config-line)# login
	Switch(config-line)#exit
	Switch(config)#exit

	Assign a VTY password and enable login.
	Switch(config)# Line vty 0 4 or 0 15
	Switch(config-line)#  password (password)

	Configure an encrypted password to secure access to privileged mode
	Switch(config)#enable secret (password)
	Switch(config)#exit

	Encrypt the plaintext passwords.
	Switch(config)#service password-encryption
 	Switch(config)#exit

	Create a banner that warns anyone accessing the device that unauthorized access is prohibited.
	Switch(config)#banner modt #

	Copy the running configuration to the startup configuration.
	Switch# copy run start

	Configure VLAN 1.
	Switch(config)#int VLAN1
	Switch(config-if)#description 'this is the description'
	Switch(config-if)#ip address 192.168.1.2 255.255.255.0
	Switch(config-if)#no shutdown
	Switch(config-if)#exit

	Configure IPv6
	Switch(config)#enable ipv6
	Switch(config)#interface range f0/2-5
	Switch(config)#switchport mode access
	Switch(config)#switchport access vlan 99
	Switch(config)#interface f0/1
	Switch(config-if)#switchport mode trunk
	Switch(config-if)#switchport trunk native vlan 1000
	Switch(config-if)#switchport trunk allowed vlan 10, 20, 30, 1000

	Configure IPv6
	Switch(config)#enable ipv6
	Switch(config)#ipv6 address 2001:db8:acdc::2/64
	Switch(config)#ipv6 address fe80::1 link-local
	Switch(config)#no shutdown

	Configure default gateway.
	Switch(config)#ip default-gateway 192.168.1.1

	Prevent console messages from interrupting commands
	Switch(config)#line con 0
	Switch(config-line)#logging synchronous

	Mac address configuration
	Switch# clear mac address-table dynamic
	Switch(config)# mac address-table static 0050.56BE.6C89 vlan 99 interface fastethernet 0/6
	
	Create vlans
	Switch(config)# vlan 10
	Switch(config-vlan)# name (name)
	
	Create vlan on the fly and delete vlan
	Switch(config)# int f0/1
	Switch(config-if)# switchoprt access vlan 30
	Switch(config)# no vlan 30
	
	Assign interface to vlan
	Switch(config)# int f0/6
	Switch(config-if)# switchport mode access
	Switch(config-if)# switchport access vlan 10

	Assign all users to a vlan
	Switch(config)#interface range f0/1-24,g01-2
	Switch(config)#switchport access vlan 99
	
	Change native vlan for an interface
	Switch(config)# interface f0/1
	Switch(config-if)# switchport trunk native vlan 1000
	
	Configure trunking
	Switch(config)# int range g0/1-2
	Switch(config-if)# switchport mode trunk
	Switch(config-if)# switchport trunk native vlan 99
	
	Set interface to negotiate trunk mode
	Switch(config)# int f0/1
	Switch(config-if)# switchport mode dynamic desirable
	
	Manually configure a port as a trunk, done on both ends
	Switch(config)# int f0/1
	Switch(config-if)# switchport mode trunk

	Disable DTP negotiation
	Switch(config)# interface g0/2
	Switch(config-if)# switchport mode trunk
	Switch(config-if)# switchport nonegotiate
	
	Useful show commands
	Switch# show startup-config
	Switch# show startup-config | section vty
	Switch# show version
	Switch# show version | include register
	Switch# show mac address-table
	Switch# show mac address-table dynamic
	Switch# show mac address-table static
	Switch# show mac address-table address xxxx.xxxx.xxxx
	Switch# show vlan (brief)
	Switch# show int vlan1
	Switch# show ip int vlan1
	Switch# show ip route
	Switch# show ip int brief
	Switch# show ipv6 int brief
	Switch# show flash
	Switch# dir flash:
	Switch# show int trunk
	Switch# show int (interface) switchport
	Switch# show dtp
	Switch# show int g0/2 switchport
	
	Initialize and Reload
	Switch#delete vlan.dat
	Switch#erase startup-config
	Switch#reload
